scores = {'А': 1, 'Б': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1,
          'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2,
          'Б': 3, 'Г': 3, 'Ь': 3, 'Я': 3,
          'И': 4, 'Ы': 4,
          'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5,
          'Ш': 8, 'Э': 8, 'Ю': 8,
          'Ф': 10, 'Щ': 10, 'Ъ': 10,}
word = input("Введите слово: ").upper()
total_score = 0
for let in word:
    if let in scores:
        total_score += scores[let]
print(f"Стоимость  слова '{word}': {total_score} очков")