group1 = ["Иванов", "Петров", "Сидоров", "Макаров", "Захаров", "Соловьёв", "Лебедев", "Никитин", "Белов", "Козлов"]
group2 = ["Смирнов", "Волков", "Кузнецов", "Васильев", "Павлов", "Семенов", "Михайлов", "Егоров", "Степанов", "Богданов"]

sport_team = group1[:5] + group2[:5]

print("Исходный список группы 1: ", group1)
print("Исходный список группы 2: ", group2)
print("Спортивная команда из 10 студентов: ", sport_team)
print("Длина кортежа команды: ", len(sport_team))

sorted_sport_team = sorted(sport_team)
print("Длина кортежа команды после сортировки: ", sorted_sport_team)

count_ivanov = sport_team.count("Иванов")
print("Фамииля 'Иванов' встречается в команде", count_ivanov, "раз")